In [3]:
import pandas as pd
import numpy as np

In [8]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [79]:
employees = pd.read_sql('SELECT * FROM employees', url)
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [10]:
#5.a.  Intentionally make a typo in the database url. What kind of error message do you see? -- removed the "s" from the "employees" table.

#(pymysql.err.OperationalError) (1044, "Access denied for user 'germain_1459'@'%' to database 'employee'")
#(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [12]:
#5.b. Intentionally make an error in your SQL query. What does the error message look like? -- removed the "s" from the "employees" table.

#(pymysql.err.ProgrammingError) (1146, "Table 'employees.employee' doesn't exist")
#[SQL: SELECT * FROM employee LIMIT 5 OFFSET 50]
#(Background on this error at: http://sqlalche.me/e/14/f405)

In [53]:
#6. Read the employees and titles tables into two separate DataFrame
titles = pd.read_sql('SELECT * FROM titles', url)
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [54]:
#7. How many rows and columns do you have in each DataFrame? Is that what you expected?
titles.shape

(443308, 4)

In [78]:
employees.shape

(300024, 6)

In [24]:
#7. Is that what you expected?
#No. It only gives the shape of the displayed table not the entire table on the server.

In [55]:
#8. Display the summary statistics for each DataFrame.
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [56]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [33]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_no      5 non-null      int64
 1   birth_date  5 non-null      object
 2   first_name  5 non-null      object
 3   last_name   5 non-null      object
 4   gender      5 non-null      object
 5   hire_date   5 non-null      object
dtypes: int64(1), object(5)
memory usage: 368.0+ bytes

In [31]:
employees.describe()

             emp_no
count      5.000000
mean   10053.000000
std        1.581139
min    10051.000000
25%    10052.000000
50%    10053.000000
75%    10054.000000
max    10055.000000

In [67]:
titles.title.unique()
#You can use nunique() in place of unique().size ??

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [80]:
#9. How many unique titles are in the titles DataFrame
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [71]:
len(titles.title.value_counts())

443308

In [82]:
#10. What is the oldest date in the to_date column?
titles.sort_values('to_date')

        emp_no            title   from_date     to_date
16064    20869         Engineer  1985-02-17  1985-03-01
406358  474918         Engineer  1985-02-10  1985-03-11
346216  434232            Staff  1985-02-26  1985-03-20
35527    34059  Senior Engineer  1985-02-10  1985-03-23
277603  287732            Staff  1985-04-14  1985-04-17
...        ...              ...         ...         ...
191714  229523  Senior Engineer  1996-11-29  9999-01-01
191712  229522  Senior Engineer  2002-01-22  9999-01-01
191707  229520            Staff  1999-09-07  9999-01-01
191723  229529  Senior Engineer  1997-04-05  9999-01-01
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [83]:
#11. What is the most recent date in the to_date column?
titles.sort_values('to_date').tail()

        emp_no            title   from_date     to_date
191714  229523  Senior Engineer  1996-11-29  9999-01-01
191712  229522  Senior Engineer  2002-01-22  9999-01-01
191707  229520            Staff  1999-09-07  9999-01-01
191723  229529  Senior Engineer  1997-04-05  9999-01-01
443307  499999         Engineer  1997-11-30  9999-01-01